app/Controllers/BlogController.php

SELECT *
FROM `blog`
SELECT *
FROM `services`
---
    public function index()
    {
        $data = [];
         $data['passLink'] = "blog";
        $data['userData'] = session()->get('userData');

        $BlogModel = new BlogModel();
        $data['all_blogs'] = $BlogModel->findAll();

        $ServiceModel = new ServiceModel();
        $data['all_categories'] = $ServiceModel->findAll();