app/Controllers/DashboardController.php

SELECT *
FROM `services`
SELECT *
FROM `customer_table`
SELECT *
FROM `team`
SELECT *
FROM `blog`
---
    public function index()
    {
        $menu = new MenuModel();
        $services = new ServiceModel();
        $customer = new CustomerModel();
        $order = new OrderModel();
        $team = new TeamModel();
        $blog = new BlogModel();


        $data = [
            'menu' => $menu->findAll(),
            'services' => $services->findAll(),
            'customer' => $customer->findAll(),
            'order' => $order->select('*')
                ->from('ordertable o') // Use alias 'o' for ordertable in the from clause
                ->join('customer_table c', 'o.serviceOrderNo = c.orderNo') // Use alias 'c' for customer_table
                ->groupBy('c.orderNo')
                ->orderBy('o.serviceOrderNo', 'ASC') // Corrected from 'orderBy' to 'orderBy'
                ->get()
                ->getResult(),
            'team' => $team->findAll(),
            'blog' => $blog->findAll(),