app/Controllers/DashboardController.php

SELECT *
FROM `menu`
---
    public function index()
    {
        $menu = new MenuModel();
        $services = new ServiceModel();
        $customer = new CustomerModel();
        $order = new OrderModel();

        $data = [
         'menu' => $menu->findAll(),
         'services' => $services->findAll(),
          'customer' => $customer->findAll(),
          'order' => $order->findAll(),
        ];