app/Controllers/MenuController.php

SELECT *
FROM `menu`
---
    public function index()
    {
        $data = [];
        $data['passedLink'] = "menu";
        $menuModel = new MenuModel();
        $data['menu_data'] = $menuModel->findAll();

SELECT *
FROM `menu`
WHERE `menu`.`menuId` = '3'
---
    public function edit($menuId)
        {
            $data = [];
            $data['passedLink'] = "menu";
            $menuModel = new MenuModel();
            $menu  = $menuModel->find($menuId);