app/Controllers/PaymentController.php

SELECT *
FROM `menu`
WHERE `menuStatus` = 1
SELECT *
FROM `services`
---
    public function index()
    {

         // get the list of menu items
         $menuModel = new MenuModel();
         $data['mainMenu'] = $menuModel->where('menuStatus', 1)->findAll();

         // get the sub menu
         $ServiceModel = new ServiceModel();
         $data['sub_menu'] = $ServiceModel->findAll();