app/Controllers/PublicController.php

SELECT *
FROM `menu`
WHERE `menuStatus` = 1
SELECT *
FROM `services`
---
    public function index()
    {
        $data  = [];

        // get the list of menu items
        $menuModel = new MenuModel();
        $data['mainMenu'] = $menuModel->where('menuStatus', 1)->findAll();

        // get the sub menu
        $ServiceModel = new ServiceModel();
        $data['sub_menu'] = $ServiceModel->findAll();

SELECT *
FROM `menu`
WHERE `menuStatus` = 1
SELECT *
FROM `services`
SELECT *
FROM `menu`
WHERE `menuName` = 'Designs'
SELECT *
FROM `services`
WHERE `serviceMenu` = '2'
---
    public function service($service)
    {
        $data  = [];


        // get the list of menu items
        $menuModel = new MenuModel();
        $data['mainMenu'] = $menuModel->where('menuStatus', 1)->findAll();

         // get the sub menu
         $ServiceModel = new ServiceModel();
         $data['sub_menu'] = $ServiceModel->findAll();

        //get the service that is requested
        $serve = $menuModel->where('menuName', $service)->find();
        $data['service'] = $serve;


        //check if the service is not found, exit;
        if(!$data['service']){
            return redirect()->to("/")->with("error","Service Not Found");
        }

        //get the sub services
        $data['sub_services'] = $ServiceModel->where('serviceMenu', $serve[0]['menuId'])->findAll();

SELECT *
FROM `blog`
ORDER BY `blog`.`id` DESC
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `blog`
SELECT *
FROM `menu`
WHERE `menuStatus` = 1
SELECT *
FROM `services`
---
    public function blog()
    {
        // get the list of menu items
        $BlogModel = new BlogModel();

        $data = [
            'blog_posts' => $BlogModel->orderBy('blog.id', 'desc')->paginate(6),
            'pager' => $BlogModel->pager,
        ];
        $menuModel = new MenuModel();
        $data['mainMenu'] = $menuModel->where('menuStatus', 1)->findAll();

         // get the sub menu
         $ServiceModel = new ServiceModel();
         $data['sub_menu'] = $ServiceModel->findAll();

SELECT *
FROM `menu`
WHERE `menuStatus` = 1
SELECT *
FROM `services`
SELECT *
FROM `blog`
GROUP BY `id`
 LIMIT 4
---
    public function blog_details($id = null)
    {
        $data = [];
        // get the list of menu items
        $menuModel = new MenuModel();
        $data['mainMenu'] = $menuModel->where('menuStatus', 1)->findAll();

         // get the sub menu
         $ServiceModel = new ServiceModel();
         $data['sub_menu'] = $ServiceModel->findAll();

        // get all team members
        $BlogModel = new BlogModel();
        $data['blog_to_read'] = $BlogModel->blog_post_to_read($id); // get the blog to be read

        if(!$data['blog_to_read'])
        {
            return redirect()->to('/')->with('error', 'The document you requested couldnot be found');
        }
        $data['recent_blogs'] = $BlogModel->groupBy('id', 'desc')->findAll(4); // find the latest 4 recent posts