app/Controllers/ServiceController.php

       public function index()
       {
           $data = [];
            $data['passedLink'] = "service";
           // get all the services
           $serviceModel = new serviceModel();
           $data['service_data'] = $serviceModel
                                    ->join('menu', 'menu.menuId = services.serviceMenu')
                                    ->groupBy('services.serviceId')
                                    ->get()
                                    ->getResult();
           // get all the menu items
           $menuModel = new MenuModel();
           $data['menu_data'] = $menuModel->findAll();
---
SELECT *
FROM `services`
JOIN `menu` ON `menu`.`menuId` = `services`.`serviceMenu`
GROUP BY `services`.`serviceId`
SELECT *
FROM `menu`