app/Controllers/TestimonialsController.php

SELECT *
FROM `testimonials`
---
    public function index(){

      $data = [];

      $data['passedLink'] = "testimonials";
        $data['userData'] = session()->get('userData');

      $testimonialModel = new TestimonialsModel();
      $data['all_testimonials'] = $testimonialModel->findAll();

SELECT *
FROM `testimonials`
WHERE `testimonials`.`id` = 'img'
---
    public function edit($id){

      $data = [];

      $data['passLink'] = "testimonials";
        $data['userData'] = session()->get('userData');

       // check if the id is null
        if(empty($id)){
            return redirect()->to('/dashboard/testimonials')->with('error', 'Unknown Error');
            exit();
        }


      $testimonialModel = new TestimonialsModel();
      $data['a_testimonial'] = $testimonialModel->find($id);

DELETE FROM `testimonials`
WHERE `id` IN ('2')
---
   public function delete($id){

      $testimonialModel = new TestimonialsModel();
      if(empty($id)){
      return redirect()->to('/dashboard')->with('error', 'Invalid perimeter');
    }


    if($testimonialModel->delete($id)){