app/Models/BlogModel.php

SELECT *
FROM `blog`
WHERE `blog`.`id` = '5'
---
public function blog_post_to_read($id)
    {
            return $this->db->table('blog')
                    ->where('blog.id', $id)
                    ->get()->getResult();